math_introduction/math_introduction.org
#+AUTHOR: Robin Heinemann
#+TITLE: Mathematischer Vorkurs
#+STARTUP: latexpreview
#+LATEX_HEADER: \usepackage{siunitx}
#+LATEX_HEADER: \usepackage{fontspec}
#+LATEX_HEADER: \newcommand{\estimates}{\overset{\scriptscriptstyle\wedge}{=}}

* Messwert und Maßeinheit
  Zu jeder phys. Größe gehören _Messwert_ und _Maßeinheit_, d.h. Zahlewert $$\cdot$$ Einheit

** Beispiel
   Geschw. $$v = \si{\kilo\meter\per\second}$$

** Bezeichungen
   | Abkürzung | Bedeutung        |
   |-----------+------------------|
   | t         | time             |
   | m         | mass             |
   | v         | velocity         |
   | a         | acceleration     |
   | F         | Force            |
   | E         | Energy           |
   | T         | Temperature      |
   | p         | momentum         |
   | I         | electric current |
   | V         | potential        |

   Wenn das lateinische  Alphabet nicht ausreicht: griechische Buchstaben
   $$\alpha, \beta, \gamma, \delta, \Delta, \Gamma, \epsilon, \zeta, \eta, \Theta, \kappa, \lambda, \mu, \nu, \Xi, \pi, \rho, \sigma, \tau, \phi, \chi, \psi, \omega, \Omega$$

** Maßeinheiten
   Maßeinheiten werden über Maßstäbe definiert.

*** Bespiel:
	\SI{1}{\meter} = Strecke, die das Licht in $$\frac{1}{299792458}\si{\second}$$ zurücklegt.

*** SI-Einheiten
	Internationaler Standart (außer die bösen Amerikaner :D)

    | Größe              | Einheit    | Symbol          |
    |--------------------+------------+-----------------|
    | Länge              | Meter      | \si{\meter}     |
    | Zeit               | Sekunden   | \si{\second}    |
    | Masse              | Kilogramm  | \si{\kilogram} |
    | elektrischer Strom | Ampere     | \si{\ampere}    |
    | Temperatur         | Kelvin     | \si{\kelvin}    |
    | Lichstärke         | Candela    | \si{\candela}   |
    | ebener Winkel      | Radiant    | \si{\radian}    |
    | Raumwinkel         | Steradiant | \si{\steradian} |
    | Stoffmenge         | Mol        | \si{\mol}       |

**** Radiant
	 Kreisumfang $$U = 2\pi r$$
	 Bogenmaß $$b = \phi r$$

	 Umrechung in Winkelgrad
	 $$\SI{2\pi}{\radian} \estimates \SI{360}{\degree}$$

	 $$\frac{Winkel in Radiant}{2\pi} = \frac{Winkel in Grad}{360}$$

**** Steradiant
	 $$\Omega = \frac{A}{r^2}$$

**** Abgeleitete Einheiten
     | Gröpe                    | Einheit | Symbol        | Equivalent                               |
     |--------------------------+---------+---------------+------------------------------------------|
     | Frequenz                 | Hertz   | \si{\hertz}   | \si{1\per\second}                        |
     | Kraft                    | Newton  | \si{\newton}  | \si{\kilogram\meter\per\square\second} |
     | Energie                  | Joule   | \si{\joule}   | \si{\newton\meter}                       |
     | Leistung                 | Watt    | \si{\watt}    | \si{\joule\per\second}                   |
     | Druck                    | Pascal  | \si{\pascal}  | \si{\newton\per\square\meter}            |
     | elektrischer Ladung      | Coulomb | \si{\coulomb} | \si{\ampere\second}                      |
     | elektrisches Potenzal    | Volt    | \si{\volt}    | \si{\joule\per\coulomb}                  |
     | elektrischer Wiederstand | Ohm     | \si{\ohm}     | \si{\volt\per\ampere}                    |
     | Kapazität                | Farad   | \si{\farad}   | \si{\coulomb\per\newton}                 |
     | magn. Fluss              | Weber   | \si{\weber}   | \si{\volt\per\second}                    |

**** Prefix / Größenordungen
     | Prefix | \log{10} | Abkürzung |
     |--------+----------+-----------|
     | Dezi   |       -1 | d         |
     | Zenti  |       -2 | c         |
     | Milli  |       -3 | m         |
     | Mikro  |       -6 | \mu       |
     | Nano   |       -9 | n         |
     | Piko   |      -12 | p         |
     | Femto  |      -15 | f         |
     | Atto   |      -18 | a         |
     | Zepta  |      -21 | z         |
     | Yokto  |      -24 | y         |
     | Deka   |        1 | D         |
     | Hekto  |        2 | h         |
     | Kilo   |        3 | k         |
     | Mega   |        6 | M         |
     | Giga   |        9 | G         |
     | Tera   |       12 | T         |
     | Peta   |       15 | P         |
     | Exa    |       18 | E         |
     | Zetta  |       21 | Z         |
     | Yotta  |       24 | Y         |

* Zeichen und Zahlen
  | Zeichen    | Bedeutung                                   |
  |------------+---------------------------------------------|
  | +          | plus                                        |
  | \cdot      | mal                                         |
  | =          | gleich                                      |
  | <          | ist kleiner als                             |
  | >          | ist größer als                              |
  | \angle     | Windel zwischen                             |
  | -          | minus                                       |
  | /          | geteilt                                     |
  | \neq       | ungleich                                    |
  | \leq       | kleiner gleich                              |
  | \geq       | größer gleich                               |
  | \simeq     | ungefähr gleich                             |
  | \pm        | plus oder minus                             |
  | \perp      | steht senkrecht auf                         |
  | \equiv     | ist identisch gleich                        |
  | \ll        | ist klein gegen                             |
  | \gg        | ist groß gegen                              |
  | \infty     | größer als jede Zahl                        |
  | \to \infty | eine Größe wächst über alle Grenzen \ Limes |
  | \sum       | Summe                                       |

** Summenzeichn
*** Beispiel
   	- $$\sum_{n=1}^3a_n=a_1 + a_2 + a_3$$
   	- Summe der ersten $m$ natürlischen Zahlen
      $$\sum_{n=1}^{m}n = 1 + 2 + \ldots + (m -1) + m = \frac{m (m + 1)}{2}$$
   	- Summe der ersten $m$ Quadrate der natürlichen Zahlen
      $$\sum_{n=1}^m n^2 = 1 + 4 + \ldots + (m-1)^2 + m^2 = \frac{m(m+1)(2m+1)}{6}$$
   	- Summe der ersten $m$ Potenzen einer Zahl ($q \neq 1$)
      $$\sum_{n=0}^m q^n = 1+q+\dots+q^{m-1}+q^m = \frac{1 - q^{m + 1}}{1-q}$$
      sog. /geometrische Summe/
	  - Beweis
	   	$$s_m = 1 + \ldots + q^m$$
	   	$$q s_m = q + \ldots + q^{m+1}$$
	   	$$s_m - q s_m = s_m(1-q) = 1-q^{m+1}$$

*** Rechenregeln
	- $$\sum_{k=m}^n a_k = \sum_{j=m}^n a_j$$
	- $$c\sum_{k=m}^n a_k = \sum_{k=m}^n c a_k$$
	- $$\sum_{k=m}^n a_k \pm \sum_{j=m}{n} b_k = \sum_{k=m}^n (a_k \pm b_k)$$
	- $$\sum_{k=m}^n a_k + \sum_{k=n+1}^p a_k = \sum_{k=m}^{p} a_k$$
	- $$\sum_{k=m}^n a_k = \sum_{k=m+p}^{n+p} a_{k-p} = \sum_{k=m-p}^{n-p} a_{k+p}$$
	- $$(\sum_{i=1}^n a_i)(\sum_{j=1}^m b_j) = \sum_{i=1}^n \sum_{j=1}^m a_i b_j = \sum_{j=1}^m \sum_{i=1}^n a_i b_j$$
	  falls $$n=m$$ $$\sum_{i,j=1}^n a_i b_j$$

** Produktzeichen
*** Beispiel
	$$\prod_{n=1}^3 a_n = a_1 a_2 a_3$$

** Fakultätszeichen
   $$m! = 1 \cdot 2 \cdot \ldots \cdot (m-1) \cdot m = \prod_{n=1}^m n$$

* misc
  mathe für physiker vs. analysis
  klasuren gebündelt
  auslandssemester
